In [37]:
import pandas as pd
import numpy as np

In [3]:
data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 
df = pd.DataFrame(data)

#### Rename column names using function. "First Name" --> "first_name", "Age" --> "age

In [12]:
df.columns = ['first_name','age','City']
df

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

#### Print the first 3 rows of the DataFrame

In [14]:
df.head(3)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

#### Find the mean age of the individuals

In [17]:
df['age'].mean()

32.5

#### Select and print only the 'Name' and 'City' columns

In [36]:
df[['first_name','City']]

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

#### Add a new column 'Salary' with random salary values

In [40]:
df['Salary'] = np.random.randn(4)*10
df

  first_name  age           City     Salary
0      Alice   25       New York  12.058895
1        Bob   30  San Francisco -11.414909
2    Charlie   35    Los Angeles  -1.839217
3      David   40        Chicago  19.389104

#### Display summary statistics of the DataFrame

In [43]:
df.describe(include='all')

       first_name        age      City     Salary
count           4   4.000000         4   4.000000
unique          4        NaN         4        NaN
top         Alice        NaN  New York        NaN
freq            1        NaN         1        NaN
mean          NaN  32.500000       NaN   4.548468
std           NaN   6.454972       NaN  13.811625
min           NaN  25.000000       NaN -11.414909
25%           NaN  28.750000       NaN  -4.233140
50%           NaN  32.500000       NaN   5.109839
75%           NaN  36.250000       NaN  13.891447
max           NaN  40.000000       NaN  19.389104

#### Create a DataFrame named sales_and_expenses with columns 'Month', 'Sales', and 'Expenses', representing monthly sales and expenses data. Use below table.
#### Month	Sales	Expenses
#### Jan	5000	3000
#### Feb	6000	3500
#### Mar	7500	4000
#### Apr	8000	4500

In [44]:
data = {'Month':['Jan','Feb','Mar','Apr'],'Sales':[5000,6000,7500,8000],'Expenses':[3000,3500,4000,4500]}
sales_and_expenses = pd.DataFrame(data)
sales_and_expenses

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

#### Calculate and display the maximum sales and expenses.

In [46]:
print(sales_and_expenses['Sales'].max())
print(sales_and_expenses['Expenses'].max())

8000
4500

#### Calculate and display the minimum sales and expenses.

In [47]:
print(sales_and_expenses['Sales'].min())
print(sales_and_expenses['Expenses'].min())

5000
3000

#### Calculate and display the average sales and expenses.

In [ ]:
print(sales_and_expenses['Sales'].mean())
print(sales_and_expenses['Expenses'].mea())

6625.0
3750.0

#### Create a DataFrame named expenses with columns 'Category', 'January', 'February', 'March', and 'April', representing monthly expenses for different categories. Use below table.
#### Category	January	February	March	April
#### Rent	1200	1300	1400	1500
#### Utilities	200	220	240	250
#### Groceries	300	320	330	350
#### Entertainment	150	160	170	180

In [59]:
data = {'Category':['Rent','Utilities','Groceries','Entertainment'],'January':[1200,200,300,150],'February':[1300,220,320,160],'March':[1400,240,330,160],'April':[1500,250,350,180]}
expenses = pd.DataFrame(data)
expenses

        Category  January  February  March  April
0           Rent     1200      1300   1400   1500
1      Utilities      200       220    240    250
2      Groceries      300       320    330    350
3  Entertainment      150       160    160    180

#### Calculate and display the maximum expense for each category.

In [68]:
max_expenses = expenses.iloc[:,1:].max(axis=1)
max_expenses

0    1500
1     250
2     350
3     180
dtype: int64

#### Calculate and display the minimum expense for each category.

In [70]:
min_expenses = expenses.iloc[:,1:].min(axis=1)
min_expenses

0    1200
1     200
2     300
3     150
dtype: int64

#### Calculate and display the average expense for each category.

In [73]:
avg_expenses = expenses.iloc[:,1:].mean(axis=1)
avg_expenses

0    1350.0
1     227.5
2     325.0
3     162.5
dtype: float64

In [76]:
expenses.set_index('Category').mean(axis=1)

Category
Rent             1350.0
Utilities         227.5
Groceries         325.0
Entertainment     162.5
dtype: float64

In [125]:
data = {'BusinessEntityID':[275,275,275,275,275,275],'SalesYear':[2005,2005,2006,2006,2006,2006],'CurrentQuota':[367000,556000,502000,550000,1429000,1324000]}
lag = pd.DataFrame(data)
lag['CurrentData'] = lag['CurrentQuota'].shift(1)
lag

   BusinessEntityID  SalesYear  CurrentQuota  CurrentData
0               275       2005        367000          NaN
1               275       2005        556000     367000.0
2               275       2006        502000     556000.0
3               275       2006        550000     502000.0
4               275       2006       1429000     550000.0
5               275       2006       1324000    1429000.0

In [126]:
data = {'BusinessEntityID':[275,275,275,275,275,275],'SalesYear':[2005,2005,2006,2006,2006,2006],'CurrentQuota':[367000,556000,502000,550000,1429000,1324000]}
lag = pd.DataFrame(data)
lag['CurrentData'] = lag['CurrentQuota'].shift(-1)
lag

   BusinessEntityID  SalesYear  CurrentQuota  CurrentData
0               275       2005        367000     556000.0
1               275       2005        556000     502000.0
2               275       2006        502000     550000.0
3               275       2006        550000    1429000.0
4               275       2006       1429000    1324000.0
5               275       2006       1324000          NaN

In [132]:
data = {'EmpId':[1,2,3,4,5],'EmpName':['Pawan','Zuzu','Parveen','Mahesh','Ramesh'],'BirthDate':['04-12-1983','28-11-1986','07-05-1977','13-01-1983','09-05-1983']}
Birthday = pd.DataFrame(data)
Birthday['BirthDate'] = pd.to_datetime(Birthday['BirthDate'], format='%d-%m-%Y')
filtered = Birthday[
    (Birthday['BirthDate'].dt.month == 5) &
    (Birthday['BirthDate'].dt.day >= 7) &
    (Birthday['BirthDate'].dt.day <= 15)
                    ]
filtered

   EmpId  EmpName  BirthDate
2      3  Parveen 1977-05-07
4      5   Ramesh 1983-05-09

#### 5th Question should be solved

In [ ]:
data = {'ID':[1,1],'Name':['P',np.nan],'Typed':[np.nan,'Q']}
unwanted_null = pd.DataFrame(data)
unwanted_null.isna()

      ID   Name  Typed
0  False  False   True
1  False   True  False

In [136]:
data = [
    ['e5', 45000],
    ['e3', 30000],
    ['e2', 49000],
    ['e4', 36600],
    ['e1', 58000]
]

df = pd.DataFrame(data, columns=['EmployeeID', 'Salary'])
print(df)

  EmployeeID  Salary
0         e5   45000
1         e3   30000
2         e2   49000
3         e4   36600
4         e1   58000

In [148]:
df.sort_values(by='Salary', ascending=False).iloc[1:2,1:]

   Salary
2   49000

In [157]:
data = {'ID':[1,2,3,4,5]}
summ_previous = pd.DataFrame(data)
summ_previous['SumPreValues'] = summ_previous['ID'].cumsum()
summ_previous

   ID  SumPreValues
0   1             1
1   2             3
2   3             6
3   4            10
4   5            15

In [163]:
data = {
    'Year1': [2001, 2002, 2003, 2004],
    'Max1': [10, 103, 21, 27],
    'Max2': [101, 19, 23, 28],
    'Max3': [87, 88, 89, 91]
}

df = pd.DataFrame(data)

df.set_index('Year1').max(axis= 1)

Year1
2001    101
2002    103
2003     89
2004     91
dtype: int64

In [ ]:
#### Should find the answer of 9

In [164]:
data = {
    'EmpID': [1, 2, 3, 4, 5],
    'EmpName': ['Pawan', 'Dheeraj', 'Isha', 'Joteep', 'Suchita'],
    'EmpSalary': [80000, 70000, 100000, 90000, 110000],
    'MgrID': [4, 4, 4, None, 4]  # or use np.nan instead of None
}

df = pd.DataFrame(data)
df

   EmpID  EmpName  EmpSalary  MgrID
0      1    Pawan      80000    4.0
1      2  Dheeraj      70000    4.0
2      3     Isha     100000    4.0
3      4   Joteep      90000    NaN
4      5  Suchita     110000    4.0

#### In this puzzle we have to find the 2nd highest salary from each department. Please check out the sample input and expected output for details.

In [165]:
dept_data = {
    'DeptID': [1, 2, 3],
    'DeptName': ['Finance', 'IT', 'HR']
}
Department = pd.DataFrame(dept_data)

emp_data = {
    'EmpID': [101, 111, 102, 103, 104, 105, 106, 107, 108],
    'EmpName': ['Isha', 'Esha', 'Mayank', 'Ramesh', 'Avtaar', 'Gopal', 'Krishna', 'Suchita', 'Ranjan'],
    'DeptID': [1, 1, 1, 2, 2, 3, 3, 3, 3],
    'EmpSalary': [7000, 8970, 8900, 4000, 9000, 17000, 1000, 7000, 17900]
}
Emps = pd.DataFrame(emp_data)
print(Department)
print(Emps)

   DeptID DeptName
0       1  Finance
1       2       IT
2       3       HR
   EmpID  EmpName  DeptID  EmpSalary
0    101     Isha       1       7000
1    111     Esha       1       8970
2    102   Mayank       1       8900
3    103   Ramesh       2       4000
4    104   Avtaar       2       9000
5    105    Gopal       3      17000
6    106  Krishna       3       1000
7    107  Suchita       3       7000
8    108   Ranjan       3      17900